src/Reports/ОтчетОЗаключенииКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОЗаключенииКонтрактов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкаПоПериодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоОсновнымДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ТрудовыеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТрудовыеДоговора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровСФизЛицами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеТрудовогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТрудовогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентПоКонтракту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспытательныйСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиВОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипТрудовогоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипТрудовогоДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ОтчетОЗаключенииКонтрактов/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда

Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокКонтракта, ДокументРезультат)
	Если ГруппировкаПоПериодам = Ложь Тогда
		Пока ВыборкаСтрокКонтракта.Следующий() Цикл 
			
			ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокКонтракта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			//Аверсон 04.03.2020 КВВ СВФР-005600 (
			Если ВыводитьПоОсновнымДоговорам Тогда
				Если ВыборкаСтрокКонтракта.Регистратор <> ВыборкаСтрокКонтракта.Сотрудник.ТрудовойДоговор Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//Аверсон 04.03.2020 КВВ СВФР-005600 )
			Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокКонтракта.ПодразделениеОрганизации Тогда			
				мНомер = 0;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокКонтракта.ПодразделениеОрганизацииКод);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
				
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокКонтракта.ПодразделениеОрганизацииНаименование;
				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				мНомер = мНомер + 1;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокКонтракта.Должность;
				ОбластьДетальныхЗаписей.Параметры.ДатаКонтракта = ВыборкаСтрокКонтракта.Регистратор.ДатаТД;
				ОбластьДетальныхЗаписей.Параметры.НомерКонтракта = ВыборкаСтрокКонтракта.НомерТД;
				ОбластьДетальныхЗаписей.Параметры.НачалоКонтракта = ВыборкаСтрокКонтракта.НачалоДоговора;
				ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ТекПодр = ВыборкаСтрокКонтракта.ПодразделениеОрганизации;
			Иначе
				мНомер = мНомер + 1;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
				ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокКонтракта.Сотрудник.Код;	
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник.Наименование;				
				ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокКонтракта.Должность;
				ОбластьДетальныхЗаписей.Параметры.ДатаКонтракта = ВыборкаСтрокКонтракта.Регистратор.ДатаТД;
				ОбластьДетальныхЗаписей.Параметры.НомерКонтракта = ВыборкаСтрокКонтракта.НомерТД;
				ОбластьДетальныхЗаписей.Параметры.НачалоКонтракта = ВыборкаСтрокКонтракта.НачалоДоговора;
				ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
				
				ТекПодр = ВыборкаСтрокКонтракта.ПодразделениеОрганизации;
			КонецЕсли;
			ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
			
		КонецЦикла;//цикл по подразделениям текущего уровня 
	Иначе
		Лет = 0;
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("ПодразделениеОрганизации");
		ТЗ.Колонки.Добавить("ПодразделениеОрганизацииКод");
		ТЗ.Колонки.Добавить("Сотрудник");
		ТЗ.Колонки.Добавить("Должность");
		ТЗ.Колонки.Добавить("ДатаКонтракта");
		ТЗ.Колонки.Добавить("НомерКонтракта");
		ТЗ.Колонки.Добавить("НачалоКонтракта");
		ТЗ.Колонки.Добавить("ОкончаниеКонтракта");
		ТЗ.Колонки.Добавить("ПериодКонтракта");
		
		Пока ВыборкаСтрокКонтракта.Следующий() Цикл 
			//Аверсон 04.03.2020 КВВ СВФР-005600 (
			Если ВыводитьПоОсновнымДоговорам Тогда
				Если ВыборкаСтрокКонтракта.Регистратор <> ВыборкаСтрокКонтракта.Сотрудник.ТрудовойДоговор Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			//Аверсон 04.03.2020 КВВ СВФР-005600 )
			НоваяСтр = ТЗ.Добавить();
			НоваяСтр.ПодразделениеОрганизации = ВыборкаСтрокКонтракта.ПодразделениеОрганизации;
			НоваяСтр.ПодразделениеОрганизацииКод = ВыборкаСтрокКонтракта.ПодразделениеОрганизации.Код;			
			НоваяСтр.Сотрудник = ВыборкаСтрокКонтракта.Сотрудник;
			НоваяСтр.Должность = ВыборкаСтрокКонтракта.Должность;
			НоваяСтр.ДатаКонтракта = ВыборкаСтрокКонтракта.Регистратор.ДатаТД;
			НоваяСтр.НомерКонтракта = ВыборкаСтрокКонтракта.НомерТД;
			НоваяСтр.НачалоКонтракта = ВыборкаСтрокКонтракта.НачалоДоговора;
			НоваяСтр.ОкончаниеКонтракта = ВыборкаСтрокКонтракта.ОкончаниеДоговора;
			Лет = 0;
			Месяцев = 0;
			Дней = 0; 
		    ОбщегоНазначения.РазобратьРазностьДат(ВыборкаСтрокКонтракта.ОкончаниеДоговора + 86400,ВыборкаСтрокКонтракта.НачалоДоговора, Лет, Месяцев, Дней);
			СтрокаПериода = "";
			Если Лет > 0 Тогда
				Если Лет = 1 Тогда
					СтрокаПериода = Строка(Лет) + " год ";
				ИначеЕсли Лет = 2 или Лет = 3 или Лет = 4 Тогда
					СтрокаПериода = Строка(Лет) + " года ";
				Иначе
					СтрокаПериода = Строка(Лет) + " лет ";
				Конецесли;
			Конецесли;	
			Если Месяцев > 0 Тогда
				СтрокаПериода = СтрокаПериода + Строка(Месяцев) + " мес.";
			КонецЕсли;
			НоваяСтр.ПериодКонтракта = СтрокаПериода;
		КонецЦикла;
		ТЗ.Сортировать("ПериодКонтракта, ПодразделениеОрганизацииКод, Сотрудник");
		
		ТекПериод = "";
		
		Для Каждого НоваяСтр из ТЗ Цикл
			
			Если ПустаяСтрока(ТекПериод) или ТекПодр <> НоваяСтр.ПериодКонтракта Тогда			
				мНомер = 0;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("ГруппаПериод");
				ОбластьДетальныхЗаписей.Параметры.Период = НоваяСтр.ПериодКонтракта;
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			КонецЕсли;
			
			Если ПустаяСтрока(ТекПодр) или ТекПодр <> НоваяСтр.ПодразделениеОрганизации Тогда			
				мНомер = 0;
				ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
				ПодразделениеОрганизацииКод = СокрЛП(НоваяСтр.ПодразделениеОрганизации.Код);
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = ПодразделениеОрганизацииКод;
				ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = НоваяСтр.ПодразделениеОрганизации.Наименование;				
				ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			КонецЕсли;
			
			мНомер = мНомер + 1;
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			ОбластьДетальныхЗаписей.Параметры.ТН = НоваяСтр.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = НоваяСтр.Сотрудник.Наименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = НоваяСтр.Должность;
			ОбластьДетальныхЗаписей.Параметры.ДатаКонтракта = НоваяСтр.Регистратор.ДатаТД;
			ОбластьДетальныхЗаписей.Параметры.НомерКонтракта = НоваяСтр.НомерКонтракта;
			ОбластьДетальныхЗаписей.Параметры.НачалоКонтракта = НоваяСтр.НачалоКонтракта;
			ОбластьДетальныхЗаписей.Параметры.ОкончаниеКонтракта = НоваяСтр.ОкончаниеКонтракта;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = НоваяСтр.ПодразделениеОрганизации;
			ТекПериод = НоваяСтр.ПериодКонтракта;		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	ТекПодр = ""; 
	
	
	СписокТиповТрудовогоДоговора = Новый СписокЗначений;	
	Если ПустаяСтрока(Тип) Тогда	
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Заключен);
		СписокТиповТрудовогоДоговора.Добавить(Перечисления.ТипТрудовогоДоговора.Продлен);
	Иначе
		СписокТиповТрудовогоДоговора = Новый СписокЗначений;
		СписокТиповТрудовогоДоговора.Добавить(Тип);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Организация," +
	
	//Аверсон ЕАЕ 22.12.2021 СВФР-008520
	//Для Бобруйска: если заполнено ПодразделениеДляПечати в Подразделении - выводим Подразделение для печати,
	//если нет - Подразделение.
	
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	//|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод," 
	
	?(Организация.ИНН = "700067572","
	
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати
	|	КОНЕЦ КАК ПодразделениеОрганизации, 
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати.Наименование
	|	КОНЕЦ КАК ПодразделениеОрганизацииНаименование,
	|	ВЫБОР 
	|	КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код
	|	ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати.Код
	|	КОНЕЦ КАК ПодразделениеОрганизацииКод,","
	
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Наименование КАК ПодразделениеОрганизацииНаименование,
	|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Код КАК ПодразделениеОрганизацииКод,") + "
	//Аверсон СВФР-008520
	
	|	РаботникиОрганизацийСрезПоследних.Должность,
	|	ТрудовыеДоговора.Период,
	|	ТрудовыеДоговора.Регистратор,
	|	ТрудовыеДоговора.Сотрудник КАК Сотрудник,
	|	ТрудовыеДоговора.ВидДоговора,
	|	ТрудовыеДоговора.НомерТД,
	|	ТрудовыеДоговора.ДействиеТрудовогоДоговора,
	|	ТрудовыеДоговора.НачалоДоговора,
	|	ТрудовыеДоговора.ОкончаниеДоговора,
	|	ТрудовыеДоговора.ПроцентПоКонтракту
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период,) КАК РаботникиОрганизацийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТрудовыеДоговора КАК ТрудовыеДоговора
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ТрудовыеДоговора.Сотрудник
	|ГДЕ
	|	ТрудовыеДоговора.НачалоДоговора >= &НачалоПериода
	|	И ТрудовыеДоговора.НачалоДоговора <= &ОкончаниеПериода
	|	И ТрудовыеДоговора.ДействиеТрудовогоДоговора В (&ДействиеТрудовогоДоговора)
	|   //И ТрудовыеДоговора.ВидДоговора = &ВидДоговора
	|   И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0	
	|   И РаботникиОрганизацийСрезПоследних.Организация = &Организация";
	Если ЗначениеЗаполнено(Подразделение) Тогда //О.Т. Аверсон 06.11.2018 № 2753
		
		//Аверсон ЕАЕ 22.12.2021 СВФР-008520
		Если Организация.ИНН = "700067572" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			|   И (ВЫБОР 
			|		КОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
			|		ТОГДА РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации
			|		ИНАЧЕ РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.ПодразделениеДляПечати
			|	   КОНЕЦ) В ИЕРАРХИИ (&Подразделение)";
		Иначе
		//Аверсон СВФР-008520
		
			ТекстЗапроса = ТекстЗапроса +"
			|   И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)";
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"	
	|УПОРЯДОЧИТЬ ПО " 
	
	//Аверсон ЕАЕ 22.12.2021 СВФР-008520
	+ ?(Организация.ИНН = "700067572", "
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,","
	|	ПодразделениеОрганизацииКод,
	|	ПодразделениеОрганизацииНаименование,") + "
	//Аверсон СВФР-008520
	
	|	Сотрудник";
	
	Запрос.УстановитьПараметр("ДействиеТрудовогоДоговора",СписокТиповТрудовогоДоговора);
	Запрос.УстановитьПараметр("НачалоПериода",НачПериод);
	Запрос.УстановитьПараметр("ОкончаниеПериода",КонПериод);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	//О.Т. Аверсон 20.12.2015 № 765
	Если ЗначениеЗаполнено(ВидДоговора) Тогда 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ТрудовыеДоговора.ВидДоговора = &ВидДоговора","И ТрудовыеДоговора.ВидДоговора = &ВидДоговора");
	иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//И ТрудовыеДоговора.ВидДоговора = &ВидДоговора","");
	КонецЕсли;
	//О.Т. Аверсон 20.12.2015 № 765
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора); //О.Т. Аверсон 20.12.2015 № 765
	//Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровСФизЛицами.Контракт);
	Запрос.УстановитьПараметр("Подразделение",      Подразделение);
	Запрос.УстановитьПараметр("Организация",      Организация);
	
	Если Не Подразделение.Пустая() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)")
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	ДокументРезультат.Очистить();
	
	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг"""); //Аверсон 04.03.2020 КВВ СВФР-005600
	ДокументРезультат.Вывести(Область);
	
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
	
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);	
	
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

мМакет = ПолучитьМакет("МакетОтчета");

#КонецЕсли
